; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
; params: miconic -f 2 -p 4 -r 327007332






(define (problem mixed-f2-p4-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 - passenger
             f0 f1 - floor)


(:init
(above f0 f1)



(origin p0 f0)
(destin p0 f1)

(origin p1 f0)
(destin p1 f1)

(origin p2 f0)
(destin p2 f1)

(origin p3 f0)
(destin p3 f1)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
))
)

; plan
1. (board f0 p3)
   added: (boarded p3)
   goals met: 0 of 4
2. (board f0 p2)
   added: (boarded p2)
   goals met: 0 of 4
3. (board f0 p1)
   added: (boarded p1)
   goals met: 0 of 4
4. (board f0 p0)
   added: (boarded p0)
   goals met: 0 of 4
5. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 4
6. (depart f1 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 4
7. (depart f1 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 4
8. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 3 of 4
9. (depart f1 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 4 of 4
